11/data/attachments/339d3db18849ebac.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_acb6179a-fa4f-4750-9c56-2d2024dc1ff9</nif:username>
            <nif:friendToBeAdded>Michael_care_Friend_71810_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>